neon-smart-studio/W-Link_NeonRTOS_Platform/src/Drivers/soc/MSPM0/driverlib/dl_crcp.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*!****************************************************************************
 *  @file       dl_crcp.h
 *  @brief      Cyclic Redundancy Check with Configurable Polynomial (CRCP) Driver Library
 *  @defgroup   CRCP Cyclic Redundancy Check with Configurable Polynomial (CRCP)
 *
 *  @anchor ti_dl_dl_crcp_Overview
 *  # Overview
 *
 *  The CRCP DriverLib allows full configuration of the MSPM0 CRCP module.
 *  The cyclic redundancy check (CRC) accelerator generates signatures for a
 *  given data sequence based on a user-configured polynomial, allowing for
 *  support of any 16-bit or 32-bit polynomial including but not limited to:
 *      * CRC32-IS03309
 *      * CRC16-ITT
 *      * CRC-32C
 *      * CRC-32K
 *      * CRC-16-Profibus
 *
 *  <hr>
 ******************************************************************************
 */
/** @addtogroup CRCP
 * @{
 */
#ifndef ti_dl_dl_crcp__include
#define ti_dl_dl_crcp__include

#include <stdbool.h>
#include <stdint.h>

#include <inc/msp.h>
#include <driverlib/dl_common.h>

#ifdef __MSPM0_HAS_CRCP__

#ifdef __cplusplus
extern "C" {
#endif

/* clang-format off */

/**
 * @brief Redirects to @ref DL_CRCP_POLYNOMIAL_SIZE_16 for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_POLYNOMIAL_SIZE_16                    DL_CRCP_POLYNOMIAL_SIZE_16

/**
 * @brief Redirects to @ref DL_CRCP_POLYNOMIAL_SIZE_32 for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_POLYNOMIAL_SIZE_32                    DL_CRCP_POLYNOMIAL_SIZE_32

/**
 * @brief Redirects to @ref DL_CRCP_BIT_REVERSED for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_BIT_REVERSED                                DL_CRCP_BIT_REVERSED

/**
 * @brief Redirects to @ref DL_CRCP_BIT_NOT_REVERSED for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_BIT_NOT_REVERSED                        DL_CRCP_BIT_NOT_REVERSED

/**
 * @brief Redirects to @ref DL_CRCP_INPUT_ENDIANESS_LITTLE_ENDIAN for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_INPUT_ENDIANESS_LITTLE_ENDIAN                                  \
                                           DL_CRCP_INPUT_ENDIANESS_LITTLE_ENDIAN

/**
 * @brief Redirects to @ref DL_CRCP_INPUT_ENDIANESS_BIG_ENDIAN for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_INPUT_ENDIANESS_BIG_ENDIAN    DL_CRCP_INPUT_ENDIANESS_BIG_ENDIAN

/**
 * @brief Redirects to @ref DL_CRCP_OUTPUT_BYTESWAP_ENABLED for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_OUTPUT_BYTESWAP_ENABLED          DL_CRCP_OUTPUT_BYTESWAP_ENABLED

/**
 * @brief Redirects to @ref DL_CRCP_OUTPUT_BYTESWAP_DISABLED for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_OUTPUT_BYTESWAP_DISABLED        DL_CRCP_OUTPUT_BYTESWAP_DISABLED

/**
 * @brief Redirects to @ref DL_CRCP_CRCPOLY_POLYNOMIAL_32_MPEG2 for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCPOLY_POLYNOMIAL_32_MPEG2  DL_CRCP_CRCPOLY_POLYNOMIAL_32_MPEG2

/**
 * @brief Redirects to @ref DL_CRCP_CRCPOLY_POLYNOMIAL_32_Q for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCPOLY_POLYNOMIAL_32_Q          DL_CRCP_CRCPOLY_POLYNOMIAL_32_Q

/**
 * @brief Redirects to @ref DL_CRCP_CRCPOLY_POLYNOMIAL_32_JAMCRC for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCPOLY_POLYNOMIAL_32_JAMCRC                                   \
                                            DL_CRCP_CRCPOLY_POLYNOMIAL_32_JAMCRC

/**
 * @brief Redirects to @ref DL_CRCP_CRCPOLY_POLYNOMIAL_32_XFER for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCPOLY_POLYNOMIAL_32_XFER                                     \
                                              DL_CRCP_CRCPOLY_POLYNOMIAL_32_XFER

/**
 * @brief Redirects to @ref DL_CRCP_CRCPOLY_POLYNOMIAL_32_MPEG2 for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCPOLY_POLYNOMIAL_32_MPEG2  DL_CRCP_CRCPOLY_POLYNOMIAL_32_MPEG2

/**
 * @brief Redirects to @ref DL_CRCP_CRCPOLY_POLYNOMIAL_16_CCIT_ZERO for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCPOLY_POLYNOMIAL_16_CCIT_ZERO                                \
                                         DL_CRCP_CRCPOLY_POLYNOMIAL_16_CCIT_ZERO

/**
 * @brief Redirects to @ref DL_CRCP_CRCPOLY_POLYNOMIAL_16_ARC for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCPOLY_POLYNOMIAL_16_ARC                                      \
                                               DL_CRCP_CRCPOLY_POLYNOMIAL_16_ARC

/**
 * @brief Redirects to @ref DL_CRCP_CRCPOLY_POLYNOMIAL_16_AUG_CCIT for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCPOLY_POLYNOMIAL_16_AUG_CCIT                                 \
                                          DL_CRCP_CRCPOLY_POLYNOMIAL_16_AUG_CCIT

/**
 * @brief Redirects to @ref DL_CRCP_CRCPOLY_POLYNOMIAL_16_BUYPASS for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCPOLY_POLYNOMIAL_16_BUYPASS                                  \
                                           DL_CRCP_CRCPOLY_POLYNOMIAL_16_BUYPASS

/**
 * @brief Redirects to @ref DL_CRCP_CRCPOLY_POLYNOMIAL_16_CCIT_FALSE for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCPOLY_POLYNOMIAL_16_CCIT_FALSE                               \
                                        DL_CRCP_CRCPOLY_POLYNOMIAL_16_CCIT_FALSE

/**
 * @brief Redirects to @ref DL_CRCP_CRCPOLY_POLYNOMIAL_16_CDMA2000 for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCPOLY_POLYNOMIAL_16_CDMA2000                                 \
                                          DL_CRCP_CRCPOLY_POLYNOMIAL_16_CDMA2000

/**
 * @brief Redirects to @ref DL_CRCP_CRCPOLY_POLYNOMIAL_16_MODBUS for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCPOLY_POLYNOMIAL_16_MODBUS                                   \
                                            DL_CRCP_CRCPOLY_POLYNOMIAL_16_MODBUS

/**
 * @brief Redirects to @ref DL_CRCP_CRCSEED_SEED_32_MPEG2 for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCSEED_SEED_32_MPEG2              DL_CRCP_CRCSEED_SEED_32_MPEG2

/**
 * @brief Redirects to @ref DL_CRCP_CRCSEED_SEED_32_Q for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCSEED_SEED_32_Q                      DL_CRCP_CRCSEED_SEED_32_Q

/**
 * @brief Redirects to @ref DL_CRCP_CRCSEED_SEED_32_JAMCRC for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCSEED_SEED_32_JAMCRC            DL_CRCP_CRCSEED_SEED_32_JAMCRC

/**
 * @brief Redirects to @ref DL_CRCP_CRCSEED_SEED_32_XFER for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCSEED_SEED_32_XFER                DL_CRCP_CRCSEED_SEED_32_XFER

/**
 * @brief Redirects to @ref DL_CRCP_CRCSEED_SEED_32_MPEG2 for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCSEED_SEED_32_MPEG2              DL_CRCP_CRCSEED_SEED_32_MPEG2

/**
 * @brief Redirects to @ref DL_CRCP_CRCSEED_SEED_16_AUG_CCIT for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCSEED_SEED_16_AUG_CCIT        DL_CRCP_CRCSEED_SEED_16_AUG_CCIT

/**
 * @brief Redirects to @ref DL_CRCP_CRCSEED_SEED_16_BUYPASS for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCSEED_SEED_16_BUYPASS          DL_CRCP_CRCSEED_SEED_16_BUYPASS

/**
 * @brief Redirects to @ref DL_CRCP_CRCSEED_SEED_16_CCIT_FALSE for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCSEED_SEED_16_CCIT_FALSE    DL_CRCP_CRCSEED_SEED_16_CCIT_FALSE

/**
 * @brief Redirects to @ref DL_CRCP_CRCSEED_SEED_16_CDMA2000 for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCSEED_SEED_16_CDMA2000        DL_CRCP_CRCSEED_SEED_16_CDMA2000

/**
 * @brief Redirects to @ref DL_CRCP_CRCSEED_SEED_16_MODBUS for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_CRCSEED_SEED_16_MODBUS            DL_CRCP_CRCSEED_SEED_16_MODBUS

/**
 * @brief Redirects to @ref DL_CRCP_enablePower for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_enablePower                                   DL_CRCP_enablePower

/**
 * @brief Redirects to @ref DL_CRCP_isPowerEnabled for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_isPowerEnabled                             DL_CRCP_isPowerEnabled

/**
 * @brief Redirects to @ref DL_CRCP_reset for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_reset                                               DL_CRCP_reset

/**
 * @brief Redirects to @ref DL_CRCP_isReset for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_isReset                                           DL_CRCP_isReset

/**
 * @brief Redirects to @ref DL_CRCP_init for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_init                                                 DL_CRCP_init

/**
 * @brief Redirects to @ref DL_CRCP_setSeed16 for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_setSeed16                                       DL_CRCP_setSeed16

/**
 * @brief Redirects to @ref DL_CRCP_setSeed32 for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_setSeed32                                       DL_CRCP_setSeed32

/**
 * @brief Redirects to @ref DL_CRCP_feedData8 for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_feedData8                                       DL_CRCP_feedData8

/**
 * @brief Redirects to @ref DL_CRCP_feedData16 for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_feedData16                                     DL_CRCP_feedData16

/**
 * @brief Redirects to @ref DL_CRCP_feedData32 for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_feedData32                                     DL_CRCP_feedData32

/**
 * @brief Redirects to @ref DL_CRCP_getResult16 for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_getResult16                                   DL_CRCP_getResult16

/**
 * @brief Redirects to @ref DL_CRCP_getResult32 for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_getResult32                                   DL_CRCP_getResult32

/**
 * @brief Redirects to @ref DL_CRCP_setPolynomial for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_setPolynomial                               DL_CRCP_setPolynomial

/**
 * @brief Redirects to @ref DL_CRCP_getPolynomial for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_getPolynomial                               DL_CRCP_getPolynomial

/**
 * @brief Redirects to @ref DL_CRCP_calculateBlock32 for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_calculateBlock32                         DL_CRCP_calculateBlock32

/**
 * @brief Redirects to @ref DL_CRCP_calculateMemoryRange32 for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_calculateMemoryRange32             DL_CRCP_calculateMemoryRange32

/**
 * @brief Redirects to @ref DL_CRCP_calculateBlock16 for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_calculateBlock16                         DL_CRCP_calculateBlock16

/**
 * @brief Redirects to @ref DL_CRCP_calculateMemoryRange16 for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_calculateMemoryRange16             DL_CRCP_calculateMemoryRange16

/**
 * @brief Redirects to @ref DL_CRCP_getCRCINAddr for compatibility
 *        between CRC and CRCP DriverLib modules
 */
#define DL_CRC_getCRCINAddr                                 DL_CRCP_getCRCINAddr

/* clang-format on */

/*! @enum DL_CRCP_POLYNOMIAL_SIZE */
typedef enum {
    /*! Use lower 16-bit value of CRCPOLY as polynomial for calculation.
     * Upon reset, user will need to update polynomial value for 16-bits,
     * such as the CRC-16-CCITT standard of 0x1021. */
    DL_CRCP_POLYNOMIAL_SIZE_16 = CRCP_CRCCTRL_POLYSIZE_CRC16,
    /*! Use 32-bit polynomial value of CRCPOLY as polynomial for calculation.
     * Defaults to the CRC32-ISO3309 standard value of 0x04C11DB7. */
    DL_CRCP_POLYNOMIAL_SIZE_32 = CRCP_CRCCTRL_POLYSIZE_CRC32
} DL_CRCP_POLYNOMIAL_SIZE;

